erp3l/src/Documents/НачислениеПроцентовПоАренде/НачислениеПроцентовПоАренде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеПроцентовПоАренде</name>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоФинансовымИнструментам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

erp3l/src/Enums/ОперацииЗакрытияМесяца/ОперацииЗакрытияМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииЗакрытияМесяца</name>
  <enumValues>
    <name>АннулированиеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ВводСведенийСреднесписочнойЧисленности</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеРасходовОтВыбытияОС</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеДублейВидовЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокВИсходныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокКорреспонденцииФинансовыхРегистров</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазвернутыхОстатковПоВзаиморасчетам</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходов</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходовВручную</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииНМА</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОС</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОСиНМАМеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>НачислениеОценочныхОбязательствРезервовПоОтпускам</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентовПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНалоговВСвязиСКоронавирусом</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВРегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеЗарплатыВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыкупаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыработкиСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеДокументовРаспределенияРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковТоваровКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовКомитентамОСписании</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПроизводстваБезЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСчетовФактурИТаможенныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаДвиженийПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаАренды</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаДенежныхСредствИФинансовыхИнструментов</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаНовыеРежимыУчета</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетВнеоборотныхАктивовВерсии24</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПроизводстваПродукцииБезСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНалоговомУчетеАрендныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПоИсследованиямИРазработкам</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеДоходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеНДС</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВВалютеПредставления</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВФункциональнойВалюте</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетПартийИСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>РасчетПроцентныхРасходовДисконтирования</name>
  </enumValues>
  <enumValues>
    <name>РасчетСтоимостиВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РеклассификацияДолгосрочныхАктивовОбязательств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатратНаВыпускБезРаспоряжений</name>
  </enumValues>
  <enumValues>
    <name>СторноДоходовКУДиР</name>
  </enumValues>
  <enumValues>
    <name>УстановкаДатыЗапретаФормированияПроводокМУ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоВнеоборотнымАктивам</name>
  </enumValues>
  <enumValues>
    <name>АктуализацияПараметровУзловКомпонентовАмортизации</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПодОбесценениеЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСводныхСправокНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАмортизацияОС</name>
    <comment>Использовалось до версии 2.4</comment>
  </enumValues>
  <enumValues>
    <name>ОбесценениеВНА</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/НачислениеПроцентовПоАренде/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокументПередЗаполнением();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокументПередЗаполнением();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВнеоборотныеАктивы.ПроверитьСоответствиеДатыВерсииУчета(ЭтотОбъект, Истина, Отказ);
	
	ПроверитьДубли(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
	СформироватьЗаданияКЗакрытиюМесяцаПриОтменеПроведения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокументПередЗаполнением()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

Процедура ПроверитьДубли(Отказ)

	Если НЕ ЗначениеЗаполнено(Организация) 
		ИЛИ НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДокумента.Ссылка
	|ИЗ
	|	Документ.НачислениеПроцентовПоАренде КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка <> &Ссылка
	|	И ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ШаблонТекста = НСтр("ru = 'За %1 уже есть проведенный документ для выбранной организации.';
							|en = 'There already exists a posted document for the selected company for %1.'");
		ТекстСообщения = СтрШаблон(ШаблонТекста, Формат(Дата, НСтр("ru = 'ДФ=''ММММ гггг ""г.""''';
																	|en = 'DF=''MMMM yyyy'''")));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НомерПакета",, Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьЗаданияКЗакрытиюМесяцаПриОтменеПроведения()

	Если ДополнительныеСвойства.Свойство("ОчисткаДляПоследующегоПроведения") 
		И ДополнительныеСвойства.ОчисткаДляПоследующегоПроведения Тогда
		Возврат;
	КонецЕсли;

	Если Документы.НачислениеПроцентовПоАренде.ТребуетсяНачислениеПроцентовПоАренде(НачалоМесяца(Дата), Организация) Тогда
		
		РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписьРегистра(
			НачалоМесяца(Дата), 
			Ссылка, 
			Организация, 
			Перечисления.ОперацииЗакрытияМесяца.НачислениеПроцентовПоАренде);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
